export const joinTextDiv = {
  memberId: [
    "아이디를 입력해주세요.",
    "아이디는 5자 이상 ~ 20자 이하여야 합니다.",
    "이미 사용중인 아이디입니다. 다른 아이디를 입력해주세요.",
  ],
  password: [
    "비밀번호를 입력해주세요.",
    "비밀번호 자릿수를 확인해주세요. (8자리~20자리)",
    "비밀번호는 영문, 숫자, 특수문자를 2종류 이상 조합하여 8~20자로 입력해주세요.",
  ],
  password_check: [
    "비밀번호를 입력해주세요.",
    "비밀번호와 비밀번호 확인 값이 일치하지 않습니다.",
    "비밀번호가 일치합니다.",
  ],
  name: ["이름을 입력해주세요.", ""],
  email: [
    "이메일을 입력해주세요.",
    "입력된 이메일은 잘못된 형식입니다.",
    "중복된 이메일이 있습니다.",
  ],
  mobile: [
    "휴대폰번호를 입력해주세요.",
    "휴대폰번호를 정확하게 입력해주세요.",
    "중복된 휴대폰번호가 있습니다.",
  ],
  available: "사용 가능합니다.",
};
